
public class Ex1305 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
 	==============================================================================================================
 	추상 클래스													인터페이스
 	==============================================================================================================
 	클래스이다(abstract ckassfh 선언)							클래스가 아니다(interface로 선언)
 	
 	일반 메소드와 추상메소드를 모두 가질 수 있다.					public abstract 충상 메소드만 가질 수 있다.
 															일반 메소드는 가질 수 없다.
 	
 	확장을 하며 extends를 사용하여 서브 클래스로 정의한다.			구현을 하며 implements로 서브 클래스를 정의한다.
 	
 	단일 상속만 가능											다중 상속이 가능하다.
 	
 	1: 다													다 : 1
 	(상위 클래스 1개, 하위 클래스는 다수)						(상위 인터페이스가 다수, 하위 클래스 1개)
 	
 	변수와 상수를 모드 가질 수 있다.								static final 형태의 상수만 가질 수 있다.
 	
 	서브 클래스에서 반드시 구현되어야 한다.						인터페이스로 선언된 내용은 하위 클래스에서 객체로 생성할 수 있다.
 */
	}

}
